{
  "Pepper__bell___Bacterial_spot": "Pepper__bell___Bacterial_spot Treatment: Bacterial spot in pepper plants can be managed by using copper-based fungicides and practicing good sanitation. Remove and destroy infected plant parts to prevent the disease from spreading.Treatment: Bacterial spot in pepper plants can be managed by using copper-based fungicides and practicing good sanitation. Remove and destroy infected plant parts to prevent the disease from spreading.",
  "Pepper__bell___healthy": "Pepper__bell___healthy ",
  "Potato___Early_blight": "Potato___Early_blight Treatment: Apply fungicides and practice crop rotation to reduce the incidence of early blight. Remove and destroy infected plant debris.",
  "Potato___healthy": "Potato___healthy",
  "Potato___Late_blight": "Potato___Late_blight Treatment: Fungicides are commonly used to manage late blight in potato plants. Regularly inspect your plants, and if you detect signs of late blight, apply fungicides promptly.",
  "Tomato__Target_Spot": "Tomato__Target_Spot Treatment: Use fungicides to control target spot disease in tomato plants. Pruning and spacing plants adequately can also improve air circulation and reduce disease incidence.",
  "Tomato__Tomato_mosaic_virus": "Tomato__Tomato_mosaic_virus Treatment : No specific cure for viral diseases. Focus on disease prevention by using disease-resistant tomato varieties and managing vector organisms (e.g., aphids).",
  "Tomato__Tomato_YellowLeaf__Curl_Virus": "Tomato__Tomato_YellowLeaf__Curl_Virus Treatment: Prevention is key. Use disease-resistant tomato varieties, employ insecticides to control whiteflies (vectors of the virus), and remove infected plants promptly to reduce virus spread.",
  "Tomato_Bacterial_spot": "Tomato_Bacterial_spot Treatment: Apply copper-based fungicides and practice sanitation to manage bacterial spot in tomato plants.",
  "Tomato_Early_blight": "Tomato_Early_blight Treatment: Similar to potato early blight, manage with fungicides and crop rotation. Remove and destroy infected plant material.",
  "Tomato_healthy": "Tomato_healthy",
  "Tomato_Late_blight": "Tomato_Late_blight Cultural practices: Remove and destroy infected plants, practice crop rotation, and avoid overhead irrigation.",
  "Tomato_Leaf_Mold": "Tomato_Leaf_Mold Cultural practices: Provide good air circulation, avoid overhead irrigation, and use disease-resistant tomato varieties if available,Fungicides may be needed in severe cases.",
  "Tomato_Septoria_leaf_spot": "Tomato_Septoria_leaf_spot Cultural practices: Remove and destroy infected leaves, provide good air circulation, and avoid overhead irrigation.",
  "Tomato_Spider_mites_Two_spotted_spider_mite": "Tomato_Spider_mites_Two_spotted_spider_mite Cultural practices: Use water sprays to reduce mite populations, maintain high humidity, and use predatory mites for biological control."
}
